---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceUtils
source: html/d9c8fb43-123e-1b26-a6c3-cb80377ea706.htm
---
# ExternalResourceUtils Methods

Gets the ids of all elements which refer to external resources.